app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
  	if params[:artist_id]
      if @artist = Artist.find_by(id: params[:artist_id])
        @songs = @artist.songs
      else
        redirect_to artists_path, alert: "Artist not found"
      end
    else
      @songs = Song.all